import re
import pymorphy2
from wordcloud import WordCloud
from collections import Counter

def main():
    stopwords = {"свой", "то", "который", "ваш", "ещё","и", "в", "во", "не", "что", "он", "на", "я", "с", "со", "как", "а", "a" "то", "все", "всё", "весь", "она", "так", "его", "но", "да", "ты", "к", "у", "же", "вы", "за", "бы", "по", "только", "ее", "мне", "было", "вот", "от", "меня", "еще", "нет", "о", "из", "ему", "теперь", "когда", "даже", "ну", "вдруг", "ли", "если", "уже", "или", "ни", "быть", "был", "него", "до", "вас", "нибудь", "опять", "уж", "вам", "ведь", "там", "потом", "себя", "ничего", "ей", "может", "они", "тут", "где", "есть", "надо", "ней", "для", "мы", "тебя", "их", "чем", "была", "сам", "чтоб", "без", "будто", "чего", "раз", "тоже", "себе", "под", "будет", "ж", "тогда", "кто", "этот", "того", "потому", "этого", "какой", "совсем", "ним", "здесь", "этом", "один", "почти", "мой", "тем", "чтобы", "нее", "сейчас", "были", "куда", "зачем", "всех", "никогда", "можно", "при", "наконец", "два", "об", "другой", "хоть", "после", "над", "больше", "тот", "через", "эти", "нас", "про", "всего", "них", "какая", "много", "разве", "три", "эту", "моя", "впрочем", "хорошо", "свою", "этой", "перед", "иногда", "лучше", "чуть", "том", "нельзя", "такой", "им", "более", "всегда", "конечно", "всю", "между", 'иза', 'это'}
    morph = pymorphy2.MorphAnalyzer()

    for i in range(1, 5):
        with open(f'Tom{i}.txt') as txt:
            vector = {}
            text = txt.read()
            text = re.sub(r'[^\w\s]', '', text)
            text = re.sub(r'[0-9]+', '', text)
            text = text.lower()
            for word in text.split():
                word = morph.parse(word)[0].normal_form
                if word not in stopwords:
                    vector[word] = vector.get(word, 0) + 1
        n = 0
        for k, v in Counter(vector).most_common(10):
            n += 1
            print(f"{n}. {k} - {v}")
        wc = WordCloud(width=2480, height=3508, max_font_size=700).generate_from_frequencies(vector)
        svg = wc.to_svg(embed_font=False)
        with open(f'Tom{i}.svg', 'w') as file:
            file.write(svg)


if __name__ == "__main__":
    main()